[
  {
    "title": "PortMaster Public Beta",
    "date": "2023-08-26",
    "author": "kloptops",
    "content": "\nPortMaster is a convenient script designed to facilitate the downloading and installation of ports for handheld devices. As the number of available ports has increased, the original interface has become progressively cumbersome. For the past few months we have been developing a new GUI.\n\nWe are delighted to present the first public beta the new PortMaster GUI.\n\n## Features (it has them)\n- Completely custom GUI using Python SDL2 bindings\n- Small size, only 3.8mb!\n- Port previews, we can really showcase the ports.\n- Cancellable downloads, accidentally started a 300mb download? Get out of here.\n- Filter ports by genre/porter/runtime\n- Localizations (We currently have English, Italian, French, and German), translators welcome!\n- Themes: Since it was possible with the custom GUI, we went for it.\nWe have a few themes at launch, but contributions are more than welcome.\nDefault Theme: comes in both light mode and dark mode\nZelda: LTTP Inspired theme\nFF VII: A beautifully done FF7 theme\nBasic Theme: A super barebones theme so you can get started designing your own!\n- Colour Schemes, themes can support multiple colour schemes for darkmode / lightmode / different colour ways.\n- Builtin theme downloader!\n\n## Nerdy features\n- Custom Sources: want to control your own ports repository? no worries!\n- Platform Hooks: PortMaster on raspberry pi? Lets gooooo.\n\n\n## Installation\nhttps://github.com/kloptops/harbourmaster/blob/main/beta.md \n"
  },
  {
    "title": "Giddy for Godot Games!",
    "date": "2023-09-19",
    "author": "Bamboozler",
    "content": "[tabreturn](https://portfolio.tabreturn.com/) has been busy porting a gigantic group of Godot games. Newly added to the list are [Burst](https://portmaster.games/detail.html?name=burst), [Donut Dodo](https://portmaster.games/detail.html?name=donut.dodo), [DROID7](https://portmaster.games/detail.html?name=droid7), [Gumgem](https://portmaster.games/detail.html?name=gumgem), [HELP! NO BRAKE](https://portmaster.games/detail.html?name=help.no.brake), [Hyper Jump](https://portmaster.games/detail.html?name=hyper.jump), [Murtop](https://portmaster.games/detail.html?name=murtop), [Starboy](https://portmaster.games/detail.html?name=starboy), and [Thwack](https://portmaster.games/detail.html?name=thwack) fwew! What a great group of games. Head over to [tabreturn's](https://portmaster.games/profile.html?porter=tabreturn) PortMaster profile and check them out."
  },
  {
    "title": "Portober Fest",
    "author": "Bamboozler",
    "date": "2023-10-25",
    "content": "[mattyj513](https://github.com/booYah187) has been consistently pumping out the ports this month. Among his recent additions to PortMaster are [Neon City Riders](https://portmaster.games/detail.html?name=neoncityriders), [Spinch](https://portmaster.games/detail.html?name=spinch), and the hit indie game Nuclear Throne, [ported to mobile](https://portmaster.games/detail.html?name=nuclearthronemobile). Head over to his PortMaster [profile](https://portmaster.games/profile.html?porter=mattyj513) and check out all his ports and check in on the testing-n-dev channel on the PortMaster [Discord](https://discord.gg/JxYBp9HTAY) server to see what other ports he is working on."
  },
  {
    "title": "Introducing the All-New PortMaster: Your Ultimate Handheld Linux Port Manager",
    "author": "kloptops",
    "date": "2023-11-05",
    "content": "We are thrilled to announce the launch of the new PortMaster, a complete overhaul of our port management program designed to provide you with an exceptional experience when installing, updating, and uninstalling Ports on your handheld Linux devices. The original PortMaster was built around the limited bash command 'dialog,' but now, we're introducing a game-changing solution with a multitude of new features and improvements that we think you'll love!\n\nWe are thrilled to unveil the all-new PortMaster, a game-changing program designed to streamline the management of Ports on your handheld Linux devices. Our revamped PortMaster is set to redefine your experience with its innovative features and improvements. Say goodbye to the limitations of the old version built upon a text-based user interface.\n\n# New Features: Unleash the Power of PortMaster\n\nWith the new and improved PortMaster, you can expect a world of enhancements and cutting-edge capabilities at your fingertips. Here's a glimpse of what's in store:\n\n## Custom GUI with Python SDL2 Bindings\n\nPortMaster now boasts a completely custom graphical user interface built using Python SDL2 bindings, providing an intuitive and user-friendly experience.\n\n## Compact and Lightweight\n\nPortMaster is incredibly efficient, with a download size of just 8MB. Say goodbye to bulky software that eats up your device's storage.\n\n## Port Previews\n\nDiscover Ports like never before with our new port preview feature. Get a sneak peek of what's in store, making it easier to choose the perfect Ports for your device.\n\n## Cancellable Downloads\n\nEver accidentally started a massive download? No worries! PortMaster allows you to cancel downloads, so you can avoid wasting time and data on unwanted files.\n\n## Enhanced Port Management\n\nFilter Ports by genre, runtime, update availability, and installation status, and sort them by name, recent additions, or recent updates for a more organized experience.\n\n## Localization Support\n\nPortMaster is available in multiple languages, including English, Italian, French, German, and Polish. We welcome contributions from translators to make it even more accessible to users around the world. [Contributions can be made through our Crowdin](https://crowdin.com/project/portmaster).\n\n## Runtime Manager\n\nManage runtimes seamlessly within PortMaster. You can install, update, verify, and uninstall runtimes directly through the program.\n\n# Introducing PortMaster Themes\n\nPortMaster now supports customizable themes. With multiple color schemes for dark mode, light mode, and unique color variations, you can tailor the program to your preferences. We even have a built-in theme downloader for your convenience. Our initial theme lineup includes:\n\n- **Default Theme**: Available in both light and dark modes.\n- **Zelda**: Inspired by the aesthetics of The Legend of Zelda: A Link to the Past.\n- **FF VII**: A visually stunning theme inspired by Final Fantasy VII.\n- **Basic Theme**: A minimalist theme, perfect for those who want to design their own.\n\n# New PortMaster Installer\n\nWe have simplified the installation process with a self-contained PortMaster installer, which is itself a basic port. This installer will self-extract and place all the necessary files in the right locations to ensure a hassle-free installation on any known Custom Firmware (CFW). Installing PortMaster is now a straightforward two-step process, and it also includes fixes for JELOS and its version of PortMaster.\n\n# Brand New Website and Wiki\n\nWe've been hard at work building a brand new website for PortMaster at https://portmaster.games/. This site includes an extensive wiki with screenshots for each port, updated documentation, and tools to assist in creating new Ports.\n\n# Join the PortMaster Discord Community\n\nWe've also launched a dedicated PortMaster Discord community. It has become a bustling hub for port enthusiasts, where you can stay updated on the latest port developments, seek assistance with ports, get help with PortMaster-related issues, or even collaborate and receive feedback on creating your own ports. [Join our Discord community today](https://discord.gg/m2QcSkMh).\n\n# Under the Hood Improvements\n\nWe've made significant enhancements under the hood. Say goodbye to the manual editing of ports.md; it has been replaced by the more advanced ports.json format. This format provides a wealth of information for each port and is now generated automatically by the ports themselves. We've even developed a tool that automates the creation of the port.json file for your convenience.\n\n# How to get it?\n\nFor **ArkOS**, **AmberELEC**, and **uOS**, simply run PortMaster on your device if it's already installed, and it will automatically update to the latest version. Otherwise you will need to follow the instructions from https://portmaster.games/installation.html"
  }
]
